Enums/омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыЗаякиНаЛабИсследованиеВЛИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаВЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЧастичныйРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьБракованныеПробы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_ЗаявкаЛИСОбщиеКлиентСерверныеПроцедуры/Ext/Module.bsl
Процедура Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Форма, Объект, АРММедсестры = Ложь) Экспорт
	
	ПринятиеВЛабораторию = Форма = Неопределено;
	
	Если Не ПринятиеВЛабораторию И Форма.Модифицированность Тогда
		Форма.Записать();
	КонецЕсли;
	
	ПолученныеДанныеЛИС = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ОтправитьЗаявкуВЛИС(Объект.Ссылка).Получить(Объект.Ссылка);
	
	Если ПолученныеДанныеЛИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКонтейнеров = ПолученныеДанныеЛИС.Контейнеры;
	
	Если МассивКонтейнеров = Неопределено Тогда 
		Возврат;
	КонецЕсли;  
	
	Объект.Контейнеры.Очистить();
	
	Для Каждого ДанныеКонтейнера Из МассивКонтейнеров Цикл
		
		СтрокаТаблицы = Объект.Контейнеры.Добавить();
		СтрокаТаблицы.Контейнер = ДанныеКонтейнера.Контейнер;
		СтрокаТаблицы.Количество = ДанныеКонтейнера.Количество;
		
	КонецЦикла;
	
	Если ПолученныеДанныеЛИС.Свойство("ЕстьКритическиеОшибки") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтклоненоЛИС");
	Иначе 
		Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтправленаВЛИС");
		Объект.ИдентификаторЛИС = ПолученныеДанныеЛИС.ИдентификаторЛИС;;
		Если Не ПринятиеВЛабораторию Или АРММедсестры Тогда
			Объект.ВремяЗабораМатериала = ТекущаяДата();
		КонецЕсли;
		Если Объект.Медсестра.Пустая() Тогда
			Объект.Медсестра = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьТекущегоСотрудника();
		КонецЕсли;
	КонецЕсли;
	
	Если ПолученныеДанныеЛИС.Свойство("Ошибки") Тогда
		Ошибки = ПолученныеДанныеЛИС.Ошибки;
	Иначе
		Ошибки = Новый Массив;
	КонецЕсли;
	
	омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ЗафиксироватьНовыеОшибкиПоЗаявке(Объект.Ссылка, Ошибки);
	
	омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ЗафиксироватьЖурналПоЗаявке(Объект.Ссылка, ПолученныеДанныеЛИС.ТелоЗапроса, ПолученныеДанныеЛИС.ТелоОтвета);
	
	Если ПринятиеВЛабораторию Тогда
		Объект.Записать();
	Иначе
		Форма.Записать();
	КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтправленаВЛИС") Тогда
		омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ОбновитьСостояниеПоДаннымЛИСНаСервере(Объект.Ссылка);
	КонецЕсли;
	
	Если Не ПринятиеВЛабораторию Тогда
		Форма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

// Функция выполняет полное (глубокое) копирование Структур, Массивов и Соответствий.
// Примитивные типы и ссылки возвращаются "как есть".
//
// Параметры:
//  Источник - Произвольный - исходный объект (Структура, Массив или значение).
//
// Возвращаемое значение:
//  Произвольный - полная копия объекта.
//
Функция СкопироватьРекурсивно(Знач Источник) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	// 1. Если это Структура
	Если ТипИсточника = Тип("Структура") Тогда
		НоваяСтруктура = Новый Структура;
		
		Для Каждого Элемент Из Источник Цикл
			// Рекурсивный вызов для значения, чтобы скопировать вложенные объекты
			ЗначениеКопии = СкопироватьРекурсивно(Элемент.Значение);
			НоваяСтруктура.Вставить(Элемент.Ключ, ЗначениеКопии);
		КонецЦикла;
		
		Возврат НоваяСтруктура;
		
	// 2. Если это Массив
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		НовыйМассив = Новый Массив;
		
		Для Каждого Элемент Из Источник Цикл
			// Рекурсивный вызов для элементов массива
			ЭлементКопии = СкопироватьРекурсивно(Элемент);
			НовыйМассив.Добавить(ЭлементКопии);
		КонецЦикла;
		
		Возврат НовыйМассив;
		
	// 3. Если это Соответствие (часто используется вместе со структурами)
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		НовоеСоответствие = Новый Соответствие;
		
		Для Каждого Элемент Из Источник Цикл
			// Копируем и значение, и ключ (если ключ вдруг тоже объектный)
			КлючКопии     = СкопироватьРекурсивно(Элемент.Ключ);
			ЗначениеКопии = СкопироватьРекурсивно(Элемент.Значение);
			НовоеСоответствие.Вставить(КлючКопии, ЗначениеКопии);
		КонецЦикла;
		
		Возврат НовоеСоответствие;
		
	// 4. Примитивные типы (Число, Строка, Дата, Булево) и Ссылки (СправочникСсылка и т.д.)
	// Они неизменяемы или передаются значением, их копировать не нужно.
	Иначе
		Возврат Источник;
	КонецЕсли;
	
КонецФункции
